Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_trial/sex_offenders_register.html.txt.tmx
Source language: en
Languages: ga

source: The Sex Offenders Act 2001 came into force in Ireland in June 2001
ga: Tháinig Acht um Chiontóirí Gnéis 2001 i bhfeidhm in Éirinn i Meitheamh 2001

source: This law has significantly changed the way sex offenders are treated by the criminal justice system in Ireland
ga: Leis an dlí seo tá athrú suntasach tagtha ar an mbealach a ndéileálann an córas ceartais choiriúil le ciontóirí gnéis in Éirinn

source: Those who are convicted of certain sexual offences are now obliged to provide certain information to the Gardaí including the address at which they are living following their release from prison
ga: Tá oibleagáid ar dhaoine a chiontaítear as cionta áirithe gnéis roinnt faisnéise a chur ar fáil do na Gardaí, lena n-áirítear an seoladh a bhfuil siad ina gcónaí i ndiaidh dóibh teacht amach as an bpríosún

source: While the term Sex Offenders Register is commonly used in Ireland, there is in fact no such register and the term is not included in any section of the Sex Offenders Act 2001
ga: Cé go n-úsáidtear an téarma Clár Ciontóirí Gnéis go coitianta in Éirinn, i bhfírinne níl a leithéid de chlár ann agus níl trácht air in aon alt den Acht um Chiontóirí Gnéis 2001

source: The only information on the whereabouts of sex offenders in Ireland which is held centrally by the Gardaí is a certificate issued by the court in relation to those convicted by the court of sexual offences
ga: Is é an t- aon fhaisnéis faoin áit a bhfuil ciontóirí gnéis in Éirinn, atá coinnithe go lárnach ag na Gardaí, ná teastas a eisíonn an chúirt maidir le daoine a ciontaíonn an chúirt i gcionta gnéis

source: This certificate states that the convicted person is now subject to the requirements of the Sex Offenders Act, 2001
ga: Sonraíonn an teastas go bhfuil an duine ciontaithe faoi réir riachtanais an Achta um Chiontóirí Gnéis, 2001

source: The Garda Domestic Violence and Sexual Assault Unit also receive a copy of the Sex Offenders Notification Form from the Garda station in whose area the sex offender resides
ga: Faigheann Aonad Foréigin Theaghlaigh agus Ionsaí Gnéis an Gharda cóip d’Fhoirm Faisnéisithe Ciontóra Gnéis ón stáisiún Garda a bhfuil an ciontóir gnéis ina chónaí ina limistéar

source: This means that details of everyone subject to the requirements of the Sex Offenders Act 2001 are held centrally and these certificates are commonly known as the Sex Offenders Register
ga: Ciallaíonn sé seo go bhfuil sonraí gach duine atá faoi réir riachtanais an Achta um Chiontóirí Gnéis 2001 á gcoinneáil go lárnach agus is é an t-ainm coitianta atá ar na teastais seo ná Clár na gCiontóirí Gnéis

source: Further information on the monitoring of sex offenders in Ireland is available here
ga: Tá tuilleadh faisnéise faoi mhonatóireacht ciontóirí gnéis in Éirinn ar fáil anseo

source: Duty to provide information to the Gardaí on whereabouts
ga: An dualgas faisnéis faoin áit a bhfuil tú a chur ar fáil do na Gardaí

source: The obligation of sex offenders to notify certain information to the Gardaí is set down in Part 2 of the Sex Offenders Act 2001
ga: Leagtar amach an oibleagáid atá ar chiontóirí gnéis faisnéis áirithe a chur in iúl do na Gardaí in Alt 2 den Acht um Chiontóirí Gnéis 2001

source: The list of sexual offences which are subject to the Act are as follows:
ga: Is é seo liosta na gcionta atá faoi réir ag an Acht:

source: • Defilement of a girl under 15 years
ga: • Truailliú cailín faoi 15 bliana

source: • Defilement of a girl 15 – 17 years
ga: • Truailliú cailín 15 – 17 bliain

source: • Attempt to commit such buggery
ga: • Iarracht ar bhugaireacht den chineál sin a dhéanamh

source: • Buggery of a person under 17 years
ga: • Bugaireacht ar dhuine faoi 17 mbliana

source: • Sexual offences against mentally impaired persons
ga: • Cionta gnéis in aghaidh duine lagintinnigh

source: • Offences under the Child Trafficking and pornography Act, 1998
ga: • Cionta faoin Acht Um Gháinneáil ar Leanaí agus Pornagrafaíocht Leanaí, 1998

source: • Sexual offences committed outside Ireland contrary to Sexual Offences (Jurisdiction) Act, 1996
ga: • Cionta gnéis a rinneadh lasmuigh d’Éirinn in aghaidh an Acht um Chionta Gnéis (Dlínse), 1996

source: • An offence of attempting to commit any offence referred to above
ga: • An cion maidir le hiarracht aon cheann de na cionta thuasluaite a dhéanamh

source: • An offence of aiding, abetting, counselling, procuring or inciting any offence referred to above
ga: • Cion maidir le bheith ag cabhrú, ag neartú, ag comhairliú, ag tabhairt ar dhuine nó ag gríosú duine chun ceann de na cionta thuasluaite a dhéanamh

source: • An offence consisting of conspiracy to commit any offence referred to above
ga: • Cion maidir le comhcheilg a dhéanamh aon cheann de na cionta thuasluaite a dhéanamh

source: In the case of sexual assault and incest, the Sex Offenders Act 2001 does not apply if the victim or other party to the offence was aged 17 years or more when the offence was committed and the person convicted has not been sentenced to any punishment involving imprisonment or made subject to any measures involving deprivation of liberty
ga: I gcás an ionsaithe gnéis agus an chiorraithe coil, ní bhaineann an tAcht um Chiontóirí Gnéis 2001 má bhí an t-íobartach nó an páirtí eile don chion 17 mbliana nó níos mó nuair a rinneadh an cion agus nuair nár ciontaíodh an duine as aon phionós a bhfuil príosúnacht mar chuid de nó curtha faoi réir ag aon bhearta a bhaineann le saoirse a chailleadh

source: In the case of defilement of a child aged under 17 years, the Act does not apply if the offender is not more than two years older than the victim
ga: Is gcás truaillithe ar leanbh faoi 17 mbliana d’aois, ní bhaineann an tAcht mura bhfuil an ciontóir níos mó ná dhá bhliain níos sine ná an t-íobartach

source: This provisions is set out in Section 3 of the Criminal Law (Sexual Offences) Act, 2006
ga: Tá an fhoráil seo leagtha amach in Alt 3 den Acht um Dhlí Coiriúil (Cionta Gnéis), 2006

source: More information on the law on sexual offences is available here
ga: Tá níos mó faisnéise ar tá an dlí ar chionta gnéis ar fáil anseo

source: What information must the sex offender provide?
ga: Cén fhaisnéis a chaithfidh an ciontóir gnéis a chur ar fáil?

source: If you are convicted of a sexual offence and becomes subject to the reporting requirements you must notify the Gardaí of your name and home address within 7 days of becoming subject to the requirements
ga: Má chiontaítear thú as cion gnéis agus má bhíonn tú faoi réir na riachtanas tuairiscithe caithfidh tú d’ainm agus do sheoladh baile a chur in iúl do na Gardaí laistigh de 7 lá ó tháinig tú faoi réir na riachtanas

source: (This normally means within 7 days following your release from prison)
ga: (De ghnáth, ciallaíonn sé seo laistigh de 7 lá ó do scaoileadh saor ón phríosún)

source: Similarly you must notify the Gardaí within 7 days of any change of name and or change of home address or if you intend to reside elsewhere in Ireland for more than 7 days
ga: Ar an dóigh chéanna, ní mór duit a chur in iúl do na Gardaí laistigh de 7 lá faoi aon athrú ainm agus nó athrú ar do sheoladh baile nó má tá rún agat a bheith i do chónaí áit ar bith eile in Éirinn ar feadh níos mó ná 7 lá

source: Offenders must also notify the Gardaí if they intend to leave Ireland for 7 days or more and are required to provide the Gardaí with the address of the place outside Ireland that they intend to reside or stay at
ga: Caithfidh ciontóirí a chur in iúl do na Gardaí chomh maith má bhíonn rún acu Éire a fhágáil ar feadh 7 lá nó níos mó agus tá riachtanas orthu seoladh na háite lasmuigh d’Éirinn a bhfuil sé de rún acu bheith ina gcónaí ann nó stopadh ann a thabhairt do na Gardaí

source: Where someone who is subject to the sex offender notification requirements is imprisoned in respect of any offence and the release of that person is imminent, the governor in charge of the prison must notify the Garda Commissioner of the pending release at least 10 days before the date of the release
ga: Nuair a chuirtear duine éigin atá faoi réir ag riachtanais faisnéisithe an chiontóra gnéis i bpríosún maidir le haon chion agus nuair a bhíonn scaoileadh saor an duine sin ar tí tarlú, caithfidh an gobharnóir i mbun an phríosúin Coimisinéir an Gharda a chur ar an eolas faoin scaoileadh sin 10 lá ar a laghad roimh dháta an scaoilte saor

source: How must an offender notify Gardaí?
ga: Cén bealach a gcaithfidh ciontóir na Gardaí a fhaisnéisiú?

source: If you are required to provide certain information to the Gardaí under the Sex Offenders Act, 2001 you may give notification in the following way:
ga: Má tá riachtanas ort roinnt faisnéise a chur ar fáil do na Gardaí faoin Acht um Chiontóirí Gnéis, 2001, is féidir leat faisnéisiú ar an mbealach seo:

source: • By attending in person at any Garda station which is a Divisional or District Headquarters. and giving the information required orally to a member of that Garda station or
ga: • Trí theacht i láthair ag aon stáisiún Gardaí atá ina cheanncheathrú Rannach nó Dúiche, agus an fhaisnéis atá de dhíth a thabhairt ó bhéal do chomhalta den stáisiún Gardaí sin

source: • By sending by post a written notification of the information required to any such Divisional or District Headquarters
ga: • Trí fhaisnéisiú scríofa den fhaisnéis atá riachtanach a chur tríd an bpost chuig aon Cheanncheathrú Rannach nó Dúiche

source: After the Gardaí receive the notification, they acknowledge it in writing
ga: I ndiaidh do na Gardaí an faisnéisiú a fháil, admhaíonn siad é i bhfoirm scríofa

source: The Gardaí also complete a Sex Offenders Notification Form
ga: Chomh maith leis sin, líonann na Gardaí Foirm Faisnéisithe Ciontóra Gnéis

source: The original completed form is sent to the Domestic Violence and Sexual Assault Investigation Unit at Harcourt Square, Harcourt Street, Dublin 2
ga: Cuirtear an bhunfhoirm chríochnaithe chuig Aonad Foréigin Theaghlaigh agus Fiosrúcháin Ionsaithe Gnéis ag Cearnóg Fhearchair, Sráid Fhearchair, Baile Átha Cliath 2

source: A copy of the form is sent to the offender and a copy is retained in the Garda station
ga: Cuirtear cóip den fhoirm chuig an gciontóir agus coinnítear cóip sa stáisiún Garda

source: How long does the requirement to notify the Gardaí last?
ga: Cá fhad a mhaireann an riachtanas na Gardaí a fhaisnéisiú?

source: You are obliged to provide information to the Gardaí regarding yourself:
ga: Tá oibleagáid ort faisnéis a sholáthar do na Gardaí fút féin:

source: • Indefinitely if you were sentenced to life imprisonment or to a term of more than 2 years
ga: • Gan teorainn ama más amhlaidh gur gearradh príosúnacht saoil ort nó téarma níos mó ná 2 bhliain

source: • For 10 years if the term of imprisonment was for between 6 months and 2 years (5 years if the offender was aged under 18)
ga: • Go ceann 10 mbliana má bhíonn an téarma príosúnachta idir 6 mhí agus 2 bhliain (5 bliana má bhíonn an ciontóir faoi 18)

source: • For 7 years if the sentence was for less than 6 months (3.5 years if the offender was aged under 18)
ga: • Go ceann 7 mbliana má bhíonn an phianbhreith níos lú ná 6 mhí (3.5 bliain má bhíonn an ciontóir faoi 18 mbliana)

source: • For 5 years if the sentence imposed was suspended or if no prison sentence was imposed (2.5 years if the offender was aged under 18)
ga: • Go ceann 5 bliana má bhíonn an phianbhreith a gearradh ar fionraí nó murar gearradh aon phianbhreith príosúnachta (2.5 bliain má bhíonn an ciontóir faoi 18 mbliana)

source: If you are sentenced to a term of imprisonment and part of that term is suspended, you are considered to be sentenced to the part not suspended
ga: Má ghearrtar téarma príosúnachta ort agus ansin cuirtear cuid den téarma sin ar fionraí, meastar gur daoradh thú don chuid nár cuireadh ar fionraí

source: Can an offender apply to have the obligation cancelled?
ga: An féidir le ciontóir iarratas a dhéanamh leis an oibleagáid a chur ar ceal?

source: Anyone required to report to the Gardaí indefinitely is allowed to apply to the Circuit Court for a cancellation from that obligation after at least 10 years have passed from the date of the person’s release from custody
ga: Aon duine a bhfuil riachtanas orthu tuairisciú chuig na gardaí ar feadh tréimhse éiginnte, tá cead acu iarratas a dhéanamh leis an Cúirt Chuarda leis an oibleagáid sin a chur ar ceal i ndiaidh tréimhse ar a laghad de dheich mbliana ón dáta ar scaoileadh an duine saor ó choimeád

source: If, however, you intend to apply for a cancellation you are required to notify the Garda Superintendent in whose area you reside of your intention to make the application
ga: Más mian leat iarratas ar chealú a dhéanamh, áfach, tá riachtanas ort an tArd-Cheannfort a bhfuil tú i do chónaí ina cheantar a chur ar an eolas go bhfuil sé ar intinn agat an t-iarratas a dhéanamh

source: What happens if an offender does not comply with the notification requirements?
ga: Cad é a tharlóidh mura gcomhlíonann ciontóir na riachtanais faisnéisithe?

source: If you fail (without reasonable excuse) to comply with the notification requirements, including providing false or misleading information, you may be prosecuted
ga: Mura gcomhlíonann tú na riachtanais faisnéisithe (gan leithscéal réasúnta a bheith agat), lena n-áirítear faisnéis bhréagach nó mhíthreorach chur ar fáil, b’fhéidir go gciontófaí thú

source: If convicted you are liable for:
ga: Má chiontaítear tá tú faoi dhliteanas:

source: • On summary conviction, to a class A fine or imprisonment for up to 12 months, or both
ga: • Ar chiontú go hachomair, fíneáil d'aicme A nó príosúnacht ar feadh suas le 12 mhí, nó iad araon

source: • On conviction on indictment, to a fine of up to €10,000 or imprisonment for up to 5 years, or both
ga: • Ar chiontú ar díotáil, fíneáil de suas le € 10,000 nó príosúnacht ar feadh suas le 5 bliana, nó iad araon

source: Do these notification requirements apply to someone convicted outside the State?
ga: An mbaineann na riachtanais faisnéisithe seo le duine éigin a ciontaíodh lasmuigh den stát?

source: If you are convicted of a sexual offence outside Ireland where that offence would constitute a sexual offence in Ireland, you are subject to the same Garda notification requirements if you subsequently come to live in Ireland
ga: Má chiontaítear thú as cion gnéis lasmuigh d’Éirinn agus dá mbeadh an cion sin ina chion gnéis in Éirinn, tá tú faoi réir na riachtanais chéanna faisnéisithe na nGardaí má thagann tú chun cónaí in Éirinn ina dhiaidh sin

source: If you fail to notify the Gardaí of your details, then the Gardaí can prosecute you for non-compliance or failure to comply with the requirements
ga: Mura gcuireann tú do mhionsonraí in iúl do na Gardaí, is féidir leis na Gardaí tú a chúiseamh as neamh-chomhlíonadh nó mainneachtain na riachtanais a chomhlíonadh
